#!/usr/bin/env python
# -*- encoding: utf-8 -*-

# filled in programmatically by selenium webdriver, don't want to delete >.<
REGIONS = {
    34: [1, 2, 3, 4, 5, 6, 7, 8, 10, 11, 12, 13, 14, 15, 16, 17, 18],  #安徽
    11: [1, 2, 3, 4, 5, 6, 7, 8, 9, 11, 12, 13, 14, 15, 16, 17, 28, 29], #北京
    50: [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 40, 41, 42, 43, 81, 82, 83, 84], #重庆
    35: [1, 2, 3, 4, 5, 6, 7, 8, 9], #福建
    62: [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 24, 26, 29, 30], #甘肃
    44: [1, 2, 3, 4, 5, 6, 7, 8, 9, 12, 13, 14, 15, 16, 17, 18, 19, 20, 51, 52, 53], #广东
    45: [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14], #广西
    52: [1, 2, 3, 4, 22, 23, 24, 26, 27], #贵州
    46: [1, 2, 90], #海南
    13: [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11], #河北 
    23: [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 27], #黑龙江
    41: [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17], #河南
    42: [1, 2, 3, 5, 6, 7, 8, 9, 10, 11, 12, 13, 28], #湖北
    43: [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 31], #湖南
    15: [1, 2, 3, 4, 5, 6, 7, 22, 25, 26, 28, 29], #内蒙古
    32: [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], #江苏
    36: [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11], #江西
    22: [1, 2, 3, 4, 5, 6, 7, 8, 24], #吉林
    21: [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14], #辽宁
    64: [1, 2, 3, 4, 5], #宁夏
    63: [1, 21, 22, 23, 25, 26, 27, 28], #青海
    14: [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 23], #山西
    37: [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17], #山东
    31: [1, 3, 4, 5, 6, 7, 8, 9, 10, 12, 13, 14, 15, 16, 17, 18, 19, 20, 30], #上海
    51: [1, 3, 4, 5, 6, 7, 8, 9, 10, 11, 13, 14, 15, 16, 17, 18, 19, 20, 32, 33, 34], #四川
    12: [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 21, 23, 25], #天津
    54: [1, 21, 22, 23, 24, 25, 26], #西藏
    65: [1, 2, 21, 22, 23, 27, 28, 29, 30, 31, 32, 40, 42, 43, 44], #新疆
    53: [1, 3, 4, 5, 6, 23, 25, 26, 27, 28, 29, 31, 32, 33, 34, 35], #云南
    33: [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11], #浙江
    61: [1, 2, 3, 4, 5, 6, 7, 8, 9, 10], #陕西
    71: [1, 2, 3, 4, 5, 6, 7, 90], #台湾
    81: [1000], #香港
    82: [1000], #澳门
    400: [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16], #海外
    100: [1000], #其他 
}

# extract from  http://js1.t.sinajs.cn/t4/apps/search/js/pl/common/searchTop.js
REGION_CODE = {
    u"省/直辖市": {
        u"code": 0,
        u"city": {
            u"城市/地区": 0
        }
    },
    u"安徽": {
        u"code": 34,
        u"city": {
            u"合肥": 1,
            u"芜湖": 2,
            u"蚌埠": 3,
            u"淮南": 4,
            u"马鞍山": 5,
            u"淮北": 6,
            u"铜陵": 7,
            u"安庆": 8,
            u"黄山": 10,
            u"滁州": 11,
            u"阜阳": 12,
            u"宿州": 13,
            u"巢湖": 14,
            u"六安": 15,
            u"亳州": 16,
            u"池州": 17,
            u"宣城": 18
        }
    },
    u"北京": {
        u"code": 11,
        u"city": {
            u"东城区": 1,
            u"西城区": 2,
            u"崇文区": 3,
            u"宣武区": 4,
            u"朝阳区": 5,
            u"丰台区": 6,
            u"石景山区": 7,
            u"海淀区": 8,
            u"门头沟区": 9,
            u"房山区": 11,
            u"通州区": 12,
            u"顺义区": 13,
            u"昌平区": 14,
            u"大兴区": 15,
            u"怀柔区": 16,
            u"平谷区": 17,
            u"密云县": 28,
            u"延庆县": 29
        }
    },
    u"重庆": {
        u"code": 50,
        u"city": {
            u"万州区": 1,
            u"涪陵区": 2,
            u"渝中区": 3,
            u"大渡口区": 4,
            u"江北区": 5,
            u"沙坪坝区": 6,
            u"九龙坡区": 7,
            u"南岸区": 8,
            u"北碚区": 9,
            u"万盛区": 10,
            u"双桥区": 11,
            u"渝北区": 12,
            u"巴南区": 13,
            u"黔江区": 14,
            u"长寿区": 15,
            u"綦江县": 22,
            u"潼南县": 23,
            u"铜梁县": 24,
            u"大足县": 25,
            u"荣昌县": 26,
            u"璧山县": 27,
            u"梁平县": 28,
            u"城口县": 29,
            u"丰都县": 30,
            u"垫江县": 31,
            u"武隆县": 32,
            u"忠县": 33,
            u"开县": 34,
            u"云阳县": 35,
            u"奉节县": 36,
            u"巫山县": 37,
            u"巫溪县": 38,
            u"石柱土家族自治县": 40,
            u"秀山土家族苗族自治县": 41,
            u"酉阳土家族苗族自治县": 42,
            u"彭水苗族土家族自治县": 43,
            u"江津区": 81,
            u"合川市": 82,
            u"永川区": 83,
            u"南川市": 84
        }
    },
    u"福建": {
        u"code": 35,
        u"city": {
            u"福州": 1,
            u"厦门": 2,
            u"莆田": 3,
            u"三明": 4,
            u"泉州": 5,
            u"漳州": 6,
            u"南平": 7,
            u"龙岩": 8,
            u"宁德": 9
        }
    },
    u"甘肃": {
        u"code": 62,
        u"city": {
            u"兰州": 1,
            u"嘉峪关": 2,
            u"金昌": 3,
            u"白银": 4,
            u"天水": 5,
            u"武威": 6,
            u"张掖": 7,
            u"平凉": 8,
            u"酒泉": 9,
            u"庆阳": 10,
            u"定西": 24,
            u"陇南": 26,
            u"临夏": 29,
            u"甘南": 30
        }
    },
    u"广东": {
        u"code": 44,
        u"city": {
            u"广州": 1,
            u"韶关": 2,
            u"深圳": 3,
            u"珠海": 4,
            u"汕头": 5,
            u"佛山": 6,
            u"江门": 7,
            u"湛江": 8,
            u"茂名": 9,
            u"肇庆": 12,
            u"惠州": 13,
            u"梅州": 14,
            u"汕尾": 15,
            u"河源": 16,
            u"阳江": 17,
            u"清远": 18,
            u"东莞": 19,
            u"中山": 20,
            u"潮州": 51,
            u"揭阳": 52,
            u"云浮": 53
        }
    },
    u"广西": {
        u"code": 45,
        u"city": {
            u"南宁": 1,
            u"柳州": 2,
            u"桂林": 3,
            u"梧州": 4,
            u"北海": 5,
            u"防城港": 6,
            u"钦州": 7,
            u"贵港": 8,
            u"玉林": 9,
            u"百色": 10,
            u"贺州": 11,
            u"河池": 12,
            u"来宾": 13,
            u"崇左": 14
        }
    },
    u"贵州": {
        u"code": 52,
        u"city": {
            u"贵阳": 1,
            u"六盘水": 2,
            u"遵义": 3,
            u"安顺": 4,
            u"铜仁": 22,
            u"黔西南": 23,
            u"毕节": 24,
            u"黔东南": 26,
            u"黔南": 27
        }
    },
    u"海南": {
        u"code": 46,
        u"city": {
            u"海口": 1,
            u"三亚": 2,
            u"其他": 90
        }
    },
    u"河北": {
        u"code": 13,
        u"city": {
            u"石家庄": 1,
            u"唐山": 2,
            u"秦皇岛": 3,
            u"邯郸": 4,
            u"邢台": 5,
            u"保定": 6,
            u"张家口": 7,
            u"承德": 8,
            u"沧州": 9,
            u"廊坊": 10,
            u"衡水": 11
        }
    },
    u"黑龙江": {
        u"code": 23,
        u"city": {
            u"哈尔滨": 1,
            u"齐齐哈尔": 2,
            u"鸡西": 3,
            u"鹤岗": 4,
            u"双鸭山": 5,
            u"大庆": 6,
            u"伊春": 7,
            u"佳木斯": 8,
            u"七台河": 9,
            u"牡丹江": 10,
            u"黑河": 11,
            u"绥化": 12,
            u"大兴安岭": 27
        }
    },
    u"河南": {
        u"code": 41,
        u"city": {
            u"郑州": 1,
            u"开封": 2,
            u"洛阳": 3,
            u"平顶山": 4,
            u"安阳": 5,
            u"鹤壁": 6,
            u"新乡": 7,
            u"焦作": 8,
            u"濮阳": 9,
            u"许昌": 10,
            u"漯河": 11,
            u"三门峡": 12,
            u"南阳": 13,
            u"商丘": 14,
            u"信阳": 15,
            u"周口": 16,
            u"驻马店": 17
        }
    },
    u"湖北": {
        u"code": 42,
        u"city": {
            u"武汉": 1,
            u"黄石": 2,
            u"十堰": 3,
            u"宜昌": 5,
            u"襄阳": 6,
            u"鄂州": 7,
            u"荆门": 8,
            u"孝感": 9,
            u"荆州": 10,
            u"黄冈": 11,
            u"咸宁": 12,
            u"随州": 13,
            u"恩施土家族苗族自治州": 28
        }
    },
    u"湖南": {
        u"code": 43,
        u"city": {
            u"长沙": 1,
            u"株洲": 2,
            u"湘潭": 3,
            u"衡阳": 4,
            u"邵阳": 5,
            u"岳阳": 6,
            u"常德": 7,
            u"张家界": 8,
            u"益阳": 9,
            u"郴州": 10,
            u"永州": 11,
            u"怀化": 12,
            u"娄底": 13,
            u"湘西土家族苗族自治州": 31
        }
    },
    u"内蒙古": {
        u"code": 15,
        u"city": {
            u"呼和浩特": 1,
            u"包头": 2,
            u"乌海": 3,
            u"赤峰": 4,
            u"通辽": 5,
            u"鄂尔多斯": 6,
            u"呼伦贝尔": 7,
            u"兴安盟": 22,
            u"锡林郭勒盟": 25,
            u"乌兰察布盟": 26,
            u"巴彦淖尔盟": 28,
            u"阿拉善盟": 29
        }
    },
    u"江苏": {
        u"code": 32,
        u"city": {
            u"南京": 1,
            u"无锡": 2,
            u"徐州": 3,
            u"常州": 4,
            u"苏州": 5,
            u"南通": 6,
            u"连云港": 7,
            u"淮安": 8,
            u"盐城": 9,
            u"扬州": 10,
            u"镇江": 11,
            u"泰州": 12,
            u"宿迁": 13
        }
    },
    u"江西": {
        u"code": 36,
        u"city": {
            u"南昌": 1,
            u"景德镇": 2,
            u"萍乡": 3,
            u"九江": 4,
            u"新余": 5,
            u"鹰潭": 6,
            u"赣州": 7,
            u"吉安": 8,
            u"宜春": 9,
            u"抚州": 10,
            u"上饶": 11
        }
    },
    u"吉林": {
        u"code": 22,
        u"city": {
            u"长春": 1,
            u"吉林": 2,
            u"四平": 3,
            u"辽源": 4,
            u"通化": 5,
            u"白山": 6,
            u"松原": 7,
            u"白城": 8,
            u"延边朝鲜族自治州": 24
        }
    },
    u"辽宁": {
        u"code": 21,
        u"city": {
            u"沈阳": 1,
            u"大连": 2,
            u"鞍山": 3,
            u"抚顺": 4,
            u"本溪": 5,
            u"丹东": 6,
            u"锦州": 7,
            u"营口": 8,
            u"阜新": 9,
            u"辽阳": 10,
            u"盘锦": 11,
            u"铁岭": 12,
            u"朝阳": 13,
            u"葫芦岛": 14
        }
    },
    u"宁夏": {
        u"code": 64,
        u"city": {
            u"银川": 1,
            u"石嘴山": 2,
            u"吴忠": 3,
            u"固原": 4,
            u"中卫": 5
        }
    },
    u"青海": {
        u"code": 63,
        u"city": {
            u"西宁": 1,
            u"海东": 21,
            u"海北": 22,
            u"黄南": 23,
            u"海南": 25,
            u"果洛": 26,
            u"玉树": 27,
            u"海西": 28
        }
    },
    u"山西": {
        u"code": 14,
        u"city": {
            u"太原": 1,
            u"大同": 2,
            u"阳泉": 3,
            u"长治": 4,
            u"晋城": 5,
            u"朔州": 6,
            u"晋中": 7,
            u"运城": 8,
            u"忻州": 9,
            u"临汾": 10,
            u"吕梁": 23
        }
    },
    u"山东": {
        u"code": 37,
        u"city": {
            u"济南": 1,
            u"青岛": 2,
            u"淄博": 3,
            u"枣庄": 4,
            u"东营": 5,
            u"烟台": 6,
            u"潍坊": 7,
            u"济宁": 8,
            u"泰安": 9,
            u"威海": 10,
            u"日照": 11,
            u"莱芜": 12,
            u"临沂": 13,
            u"德州": 14,
            u"聊城": 15,
            u"滨州": 16,
            u"菏泽": 17
        }
    },
    u"上海": {
        u"code": 31,
        u"city": {
            u"黄浦区": 1,
            u"卢湾区": 3,
            u"徐汇区": 4,
            u"长宁区": 5,
            u"静安区": 6,
            u"普陀区": 7,
            u"闸北区": 8,
            u"虹口区": 9,
            u"杨浦区": 10,
            u"闵行区": 12,
            u"宝山区": 13,
            u"嘉定区": 14,
            u"浦东新区": 15,
            u"金山区": 16,
            u"松江区": 17,
            u"青浦区": 18,
            u"南汇区": 19,
            u"奉贤区": 20,
            u"崇明县": 30
        }
    },
    u"四川": {
        u"code": 51,
        u"city": {
            u"成都": 1,
            u"自贡": 3,
            u"攀枝花": 4,
            u"泸州": 5,
            u"德阳": 6,
            u"绵阳": 7,
            u"广元": 8,
            u"遂宁": 9,
            u"内江": 10,
            u"乐山": 11,
            u"南充": 13,
            u"眉山": 14,
            u"宜宾": 15,
            u"广安": 16,
            u"达州": 17,
            u"雅安": 18,
            u"巴中": 19,
            u"资阳": 20,
            u"阿坝": 32,
            u"甘孜": 33,
            u"凉山": 34
        }
    },
    u"天津": {
        u"code": 12,
        u"city": {
            u"和平区": 1,
            u"河东区": 2,
            u"河西区": 3,
            u"南开区": 4,
            u"河北区": 5,
            u"红桥区": 6,
            u"塘沽区": 7,
            u"汉沽区": 8,
            u"大港区": 9,
            u"东丽区": 10,
            u"西青区": 11,
            u"津南区": 12,
            u"北辰区": 13,
            u"武清区": 14,
            u"宝坻区": 15,
            u"宁河县": 21,
            u"静海县": 23,
            u"蓟县": 25
        }
    },
    u"西藏": {
        u"code": 54,
        u"city": {
            u"拉萨": 1,
            u"昌都": 21,
            u"山南": 22,
            u"日喀则": 23,
            u"那曲": 24,
            u"阿里": 25,
            u"林芝": 26
        }
    },
    u"新疆": {
        u"code": 65,
        u"city": {
            u"乌鲁木齐": 1,
            u"克拉玛依": 2,
            u"吐鲁番": 21,
            u"哈密": 22,
            u"昌吉": 23,
            u"博尔塔拉": 27,
            u"巴音郭楞": 28,
            u"阿克苏": 29,
            u"克孜勒苏": 30,
            u"喀什": 31,
            u"和田": 32,
            u"伊犁": 40,
            u"塔城": 42,
            u"阿勒泰": 43,
            u"石河子": 44
        }
    },
    u"云南": {
        u"code": 53,
        u"city": {
            u"昆明": 1,
            u"曲靖": 3,
            u"玉溪": 4,
            u"保山": 5,
            u"昭通": 6,
            u"楚雄": 23,
            u"红河": 25,
            u"文山": 26,
            u"思茅": 27,
            u"西双版纳": 28,
            u"大理": 29,
            u"德宏": 31,
            u"丽江": 32,
            u"怒江": 33,
            u"迪庆": 34,
            u"临沧": 35
        }
    },
    u"浙江": {
        u"code": 33,
        u"city": {
            u"杭州": 1,
            u"宁波": 2,
            u"温州": 3,
            u"嘉兴": 4,
            u"湖州": 5,
            u"绍兴": 6,
            u"金华": 7,
            u"衢州": 8,
            u"舟山": 9,
            u"台州": 10,
            u"丽水": 11
        }
    },
    u"陕西": {
        u"code": 61,
        u"city": {
            u"西安": 1,
            u"铜川": 2,
            u"宝鸡": 3,
            u"咸阳": 4,
            u"渭南": 5,
            u"延安": 6,
            u"汉中": 7,
            u"榆林": 8,
            u"安康": 9,
            u"商洛": 10
        }
    },
    u"台湾": {
        u"code": 71,
        u"city": {
            u"台北": 1,
            u"高雄": 2,
            u"基隆": 3,
            u"台中": 4,
            u"台南": 5,
            u"新竹": 6,
            u"嘉义": 7,
            u"其他": 90
        }
    },
    u"香港": {
        u"code": 81,
        u"city": {
            u"香港": 1
        }
    },
    u"澳门": {
        u"code": 82,
        u"city": {
            u"澳门": 1
        }
    },
    u"海外": {
        u"code": 400,
        u"city": {
            u"美国": 1,
            u"英国": 2,
            u"法国": 3,
            u"俄罗斯": 4,
            u"加拿大": 5,
            u"巴西": 6,
            u"澳大利亚": 7,
            u"印尼": 8,
            u"泰国": 9,
            u"马来西亚": 10,
            u"新加坡": 11,
            u"菲律宾": 12,
            u"越南": 13,
            u"印度": 14,
            u"日本": 15,
            u"其他": 16
        }
    },
    u"其他": {
        u"code": 100,
        u"city": {
            u"不限": 1000
        }
    }
}

CODE_REGION = {}
for province in REGION_CODE:
    CODE_REGION.update({REGION_CODE[province]['code']: province})

